{"version":"https://jsonfeed.org/version/1","title":"admataz - code, tools, games and viz with javascript","description":"admataz is the web portfolio and professional showcase for Adam Davis","expired":false,"items":[{"id":"https://admataz.com/tools/filterfind","title":"Filter:Find","summary":"Filter:Find uses an intuitive pattern to makes relevant content findable with a few easy clicks","content_html":"<p><em>Filter:Find</em> provides a way to create, manage and publish collections of content items.  The use tags as the organising structure for the content provides the basis for an intuitive navigation that makes this both easy for editors to manage, and simple for users to find content that is useful to them in a few easy clicks. </p>\n<p><img src=\"./img/filterfind.gif\" alt=\"Click. Filter. Find.\"></p>\n<p>Filterfind is available as a hosted service or as code hosted in your own environment, either node.js or a WordPress plugin.</p>\n<p><a href=\"https://filterfind.demo.admataz.com\">See the Filter:Find demo</a></p>\n","url":"https://admataz.com/tools/filterfind","tags":["code","adam davis","web"],"date_published":"2019-12-07","author":{"name":"Adam Davis"}},{"id":"https://admataz.com/code/swimming","title":"Swimming love poem","summary":"some fun with svg","content_html":"<p>motion, poetry, flow with animation and SVG. no purpose, just experimentation. And love. </p>\n<p>Play with the controls to get pleasing effects. </p>\n<p><a href=\"https://github.com/admataz/swimming-love-poem\">source code</a></p>\n  <div id=\"swimming-container\" style=\"height:100%\"></div>\n\n","url":"https://admataz.com/code/swimming","tags":["code","adam davis","web"],"date_published":"2019-12-05","author":{"name":"Adam Davis"}},{"id":"https://admataz.com/code/shape-shop","title":"Shape shop","summary":"some fun with react","content_html":"<p>Some fun with <a href=\"https://facebook.github.io/react/\">React</a> - that Javascript library people keep talking about.</p></p>\n<p><a href=\"https://github.com/admataz/shape-shop\">Source code to this experiment</a></p>\n  <div style=\"background-color:#fff; border: 2px solid #000; box-shadow: 4px 4px 4px #666; padding: 20px; display: flex;\">\n  <div id=\"app\" ></div>\n  </div>\n\n","url":"https://admataz.com/code/shape-shop","tags":["code","adam davis","web"],"date_published":"2019-10-07","author":{"name":"Adam Davis"}},{"id":"https://admataz.com/code/sparklines","title":"Sparklines","summary":"","content_html":"<p>Sparklines: </p>\n<blockquote>\n<p>&quot;small graphic designed to give a quick representation of numerical or statistical information within a piece of text, taking the form of a graph without axes.&quot;</p>\n</blockquote>\n<p>Change the numbers, track the line. </p>\n<div id=\"app\" style=\"border:2px solid #000; padding: 8px; background-color: #fff;\"></div>\n\n<p><a href=\"https://github.com/admataz/sparklines\">Source code to this experiment</a></p>\n","url":"https://admataz.com/code/sparklines","tags":["code","adam davis","web"],"date_published":"2019-10-07","author":{"name":"Adam Davis"}},{"id":"https://admataz.com/tools/blockstatic-site-generator","title":"Blockstatic site generator","summary":"Build static html websites from markdown using this desktop command line package","content_html":"<p><img src=\"/tools/blockstatic-site-generator/img/blockstatic2.png\" alt=\"Blockstatic\"></p>\n<p>Blockstatic is a collection of utilities that can be used to generate static HTML content pages from Markdown and JSON data files and using Handlebars.js templates. This module can be used alongside other build tasks that look after assets, scripts or styles.</p>\n<p>Blockstatic can be used as with a simple command line interface - or as a library in your custom build scripts. </p>\n<ul>\n<li><a href=\"https://www.npmjs.com/package/blockstatic\">npm module</a></li>\n<li><a href=\"https://github.com/admataz/blockstatic\">source code</a></li>\n</ul>\n","url":"https://admataz.com/tools/blockstatic-site-generator","tags":["code","adam davis","web"],"date_published":"2019-10-07","author":{"name":"Adam Davis"}},{"id":"https://admataz.com/notes/recent-listening-podcasts-2020-01-30","title":"Recent listening - my podcast picks for this week","summary":"Some of the podcast episodes that have been filling the gap between my ears over the last couple days.","content_html":"<h2 id=\"50-things-that-made-the-modern-economy\"><a href=\"https://www.bbc.co.uk/programmes/p04b1g3c\">50 Things That Made the Modern Economy</a></h2>\n<p>Every episode of this podcast series is an educational gem with great storytelling, humour and useful references. I recently enjoyed the episode about <a href=\"https://www.bbc.co.uk/programmes/w3csz2xh\">The great Tulip crash of 1637</a>, &quot;the first great financial bubble&quot; - and there are about a hundred other episodes worth working through.</p>\n<blockquote>\n<p>Tim Harford tells the fascinating stories of inventions, ideas and innovations which have helped create the economic world.</p>\n</blockquote>\n<p><a href=\"https://99percentinvisible.org/episode/the-worst-video-game-ever/?utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A%2099percentinvisible%20%2899%25%20Invisible%29\">The Worst Video Game Ever - 99% Invisible</a></p>\n<p>I remember being about 7 or 8 years old and the joy of the bleeps and blocks of early video games through the TVs of relatives and friends (we had no such thing in our house). The sound effects in this episode transport me back. I don&#39;t remember ever seeing or playing the E.T. game. It&#39;s a fascinating story.</p>\n<blockquote>\n<p>Deep within the National Museum of American History’s vaults is a battered Atari case containing what’s known as “the worst video game of all time.”</p>\n</blockquote>\n<h2 id=\"writers-writing-readers-reading-creators-creating--a16z-podcast\"><a href=\"https://a16z.simplecast.com/episodes/writers-readers-publishers-newsletters-creators-online-thebrowser-substack-SLaTzj8K\">Writers Writing, Readers Reading, Creators Creating | a16z Podcast</a></h2>\n<p><a href=\"https://a16z.simplecast.com/episodes/writers-readers-publishers-newsletters-creators-online-thebrowser-substack-SLaTzj8K\"></a></p>\n<p>A lot of biz buzz hot air, but also some interesting, and even some inspiring perspectives on being an independent creator, and influencer, and generally well-connected and networked professional in this era of self-publishing. Guests include the editor of <a href=\"https://thebrowser.com\">The Browser</a> and the CEO of <a href=\"https://substack.com\">Substack</a> -  a platform looking to capture the commercial potential of indie writers.   It&#39;s an interesting time to be creative and willing to test the new platform and engage with it in an entrepreneurial spirit.</p>\n<blockquote>\n<p>A new ecosystem is forming around the direct relationship between consumers, content creators, and the tools and business models to facilitate all that.</p>\n</blockquote>\n<h2 id=\"bbc-radio-4---analysis-get-woke-or-go-broke\"><a href=\"https://www.bbc.co.uk/programmes/m000dq2w\">BBC Radio 4 - Analysis, Get woke or go broke?</a></h2>\n<p>My 7-year-old alerted me to the term &#39;woke&#39; the other day, asking question about the grammar in headlines he&#39;d picked up looking at the newspaper lying on the kitchen table. This episode explores and challenges the &#39;woke&#39; business concept.</p>\n<blockquote>\n<p> The Economist&#39;s Philip Coggan asks whether businesses are serious about getting woke or whether it&#39;s all smoke and mirrors and merely designed to part us with our money.</p>\n</blockquote>\n<h2 id=\"running-experiments-when-there-are-network-effects--linear-digressions\"><a href=\"http://lineardigressions.com/episodes/2020/1/11/running-experiments-when-there-are-network-effects\">Running experiments when there are network effects — Linear Digressions</a></h2>\n<p>I was listening to this episode on my way home from the school drop this morning when I bumped into a neighbour. I was polite enough to remove my headphones and while we walked home together I tried to explain what I had been listening to.  He looked at me like I was crazy. But as far as episodes of <a href=\"http://lineardigressions.com\">Linear Digressions</a> go, this is probably the most accessible I&#39;ve listened to so far. Usually it&#39;s a deep technical dive into something about Machine Learning or Artificial Intelligence, that doesn&#39;t shy away from the complexity of the maths, models, and theories behind the science of it all. This episode is easier to understand - and has a great explanation for the effectiveness of vaccination.</p>\n<blockquote>\n<p> Traditional A/B tests assume that whether or not one person got a treatment has no effect on the experiment outcome for another person. But that’s not a safe assumption, especially when there are network effects</p>\n</blockquote>\n<h2 id=\"bbc-radio-4---more-or-less-behind-the-stats-netflix-and-chill\"><a href=\"https://www.bbc.co.uk/programmes/p0819sc4\">BBC Radio 4 - More or Less: Behind the Stats, Netflix and Chill</a></h2>\n<p><a href=\"https://www.bbc.co.uk/programmes/b006qshd\">More or Less</a> from the BBC interrogates the statistics and numbers behind claims and tries to establish some truth. In this episode Tim Harford unpicks some claims around the impact of digital streaming.</p>\n<blockquote>\n<p>We test the claim that watching 30 minutes of Netflix has the same carbon footprint as driving four miles.</p>\n</blockquote>\n","url":"https://admataz.com/notes/recent-listening-podcasts-2020-01-30","tags":["podcasts","web","media"],"date_published":"2020-01-30T00:00:00.000Z","author":{"name":"Adam Davis"}},{"id":"https://admataz.com/notes/site-updates-december-2019","title":"admataz.com updates","summary":"I've made a few changes to this most recent version of admataz.com","content_html":"<p>In my spare time for the last couple months I&#39;ve been making some updates to <a href=\"https://admataz.com\">admataz.com</a>. </p>\n<h3 id=\"content-and-structure-updates\">Content and structure updates</h3>\n<p>The initial change that was needed was <strong>content and structure</strong> - the site was out of date with where I am now professionaly. I have moved focus from being a self employed consultant, with <em>admataz the business</em> to a full-time remote developer working for <a href=\"https://nearform.com\">NearForm</a>. Many of the client websites I worked on and that were part of my portfolio, case studies and showcase were getting out of date, or not relevant. The focus of my work life has changed, and <em>admataz the website</em> now lives on as my personal space to experiment, express and share. </p>\n<h3 id=\"technical-updates\">Technical updates</h3>\n<ul>\n<li>I rewrote <a href=\"https://npmjs.org/packages/blockstatic\">Blockstatic</a> and released version <code>2.0</code> that is used to build this site&#39;s HTML.  Blockstatic is a node.js  static site generator I wrote to convert my source Markdown content files into the HTML for the site you are looking at right now. I modernised the JavaScript in Blockstatic, and added some new features. Hopefully this makes it even easier for me to add new content, and share some code and ideas</li>\n<li>I reassembled the scrolly background boxes as a <a href=\"https://developer.mozilla.org/en-US/docs/Web/Web_Components\">Web Component</a>, authored with <a href=\"https://svelte.dev\">Svelte.js</a>. A long time ago in their first iteration, they were written with Ractive.js, and then updated as a React.js component - and now Svelte - kindof full circle. Same behaviour,  different libraries. </li>\n<li>I&#39;ve cleaned up the site&#39;s javascript and removed any dependency on jQuery - and generally reduced the download sizes for pages. </li>\n<li>With the changes in Blockstatic, I&#39;m able to embed images, scripts and styles for specific pages. This allows me to easily create showcase example pages containing modular javascript with specific style requirements, without polluting the global style or script objects - and that are downloaded on that page only. </li>\n</ul>\n<h3 id=\"design-updates\">Design updates</h3>\n<p>Design is an ongoing exercise in shifting pixels. It&#39;s never complete. Things look a pretty much the same as they did in the previous site - I&#39;ve changed typefaces, and made things a bit better in mobile view. </p>\n<div id=\"svg-logo\"></div>\n\n<p>If you want to compare - I&#39;ve kept the old site in the archive. You can see it <a href=\"https://archive2016.demo.admataz.com\">here</a>. </p>\n","url":"https://admataz.com/notes/site-updates-december-2019","tags":["site updates","code","redesign"],"date_published":"2019-12-20T00:00:00.000Z","author":{"name":"Adam Davis"}},{"id":"https://admataz.com/notes/react-still-everywhere-2019","title":"React is still everywhere.","summary":"Two and a half years ago I noted my fears of a dominant JavaScript framework. My thoughts have evolved and I feel a little better about it now.","content_html":"<p>When I wrote about <a href=\"/notes/react-everywhere\">problems I perceived with React.js</a> in 2017, I saw it as a potentially over-dominant paradigm in the minds and activities of web developers. For recruiters and managers it was an easy box to tick. It was a honey trap.</p>\n<p>With time, my perceptions have evolved. React is probably more popular and dominant now than ever, but my fear of vendor lock-in has subsided. Using React daily at work has taught me new things about JavaScript.  I have grown to value its place in my UI developer toolbox.  More broadly I have grown to appreciate the React patterns and paradigms, and its ecosystem and the contribution its active communities make to my better use of JavaScript generally.</p>\n<p>The <a href=\"https://reactjs.org/docs/design-principles.html\">patterns that inform React&#39;s design</a>, and the approaches to using React have high interoperability with the rest of my tech stack. I am now more familiar with patterns like composition and other functional programming concepts. I now make better use of modern idiomatic JavaScript. I now understand better some of the design decisions and trade offs that go into developing a reactive UI with state management. These are not concepts unique to React. But React&#39;s role in bringing the conversations forward, and educating developers is clear.</p>\n<p>I use React daily, but not exclusively.  I like to experiment with other frameworks and ideas. But I think I am a better developer for the presence of React in my universe, if I&#39;m using it or not.</p>\n<p>Well for now, at least. Will check again in a couple years time…</p>\n","url":"https://admataz.com/notes/react-still-everywhere-2019","tags":["opinion","JavaScript","React","frameworks","libraries"],"date_published":"2019-12-16T00:00:00.000Z","author":{"name":"Adam Davis"}},{"id":"https://admataz.com/notes/career-update-story-2020","title":"a career update story","summary":"From self employed consultant and contractor to full time remote developer - my career development over the last few years has even taken me by surprise. The lesson I learned is to be prepared for anything…","content_html":"<p>In February 2016 I put <em>admataz</em>, the business, on the backburner. I needed to recover from a series of difficult projects for clients - the  familiar scope-creep, the many late nights (again), the high-stake expectations and the changed requirements.  And of course, the late payments. I discovered running a small business meant a lot more than providing the skills of a web developer for hire -  delivering successful communications projects for clients required deeper interrogation of the entire business structure and operation. What starts as budget for a two month project building a website stretches into a 6 month strategic consultancy.  I needed a break, and I had the offer of a six-week contract working on-site for a department store House of Fraser&#39;s ecommerce site in the West End which I accepted.  One thing led to another, and 12 months later I finally emerged, ready again for business.</p>\n<p>And so it was then that I learned another valuable lesson in business: without momentum and ongoing self promotion and keeping the business profile active and alive - it&#39;s difficult to get off to a cold start. Where I was drowning under client demands a couple years earlier - I couldn&#39;t drum up a paid project from any new clients. I had put myself out of the loop.</p>\n<p>Panic stations. Back to contract work…</p>\n<p>It was at this time I was rejected by an agency recruiter who was little older than my years in this business - on the basis that my experience as a web developer counted little against the latest new JavaScript library. He said I needed to show I had React.js &quot;in production&quot;. React had ascended sharply in popularity in 2017 - the months I was under cover of contract work rescuing a legacy JQuery project.  I don&#39;t know if it was really the React requirement, or just bad timing, but finding a contract was proving more difficult than I&#39;d hoped.</p>\n<p>I know that finding work is a little bit about luck, and about meeting the right people at the right time, and keeping options open and conversations going, and keep on keeping on.  But every day that went by without positive leads, no matter how experienced or full of self belief I may have been, felt like a knock. I was beginning to worry.  </p>\n<p>And indeed it was a casual conversation at the pub that turned things around.  My friend Simon, one of the co-organisers at LNUG said after one meetup that he&#39;d put a word in for me at his company - they were often hiring. OK. Sounded good. A couple email exchanges and an interview later,  I was hired on a new contract as a remote developer at <a href=\"https://nearform.com\">NearForm</a> -  one of the best companies and working arrangements I could imagine.</p>\n<p>NearForm is stacked with amazing developers, some of whom are working on core parts of the open source technologies we use daily. Joining the team and working with such talent has been a brilliant boost for me. The two and half years have seen some hard work - I have learned more than any other workplace - and I have loved every day of work since joining.</p>\n<p>Working remote with a team distributed across the world has been a learning curve on its own - the etiquette of video meetings takes some getting used to, the Slack channels need to be tamed, the languages and accents of co-workers need to be understood- and all without direct eye contact and body language…   Technical problems can fester if we don&#39;t reach out for help and clarification - and as soon as we do team members are there to help each other.  NearForm work hard as employers to keep the human side alive - and to keep it interesting. Working remotely can be lonesome   and we make sure to support each other.  We meet annually as a company and sometimes more often as teams. We are encouraged to keep life and work in balance. We are valued and trusted.</p>\n<p>This is my life as a developer now. In balance.</p>\n<p><a href=\"https://admataz.com\">admataz</a> lives on as my online monicker and the place for me to share my ideas and experiments with code.</p>\n","url":"https://admataz.com/notes/career-update-story-2020","tags":["career","remote working","NearForm","employment"],"date_published":"2019-12-15T00:00:00.000Z","author":{"name":"Adam Davis"}},{"id":"https://admataz.com/notes/react-everywhere","title":"React everywhere","summary":"More and more, familiarity with React.js is required for contract web developers. It takes the mental hoop-jumping out of a lot of the day-to-day development tasks - and allows us to be more productive. Is there a cost to this?","content_html":"<p><a href=\"https://facebook.github.io/react/\">&quot;React - A JavaScript library for building user interfaces&quot;</a>  - it&#39;s a pretty good thing. It encourages an approach to developing interfaces that takes much of the mental hoop-jumping out of our day-to-day development tasks. It allows us to be more productive and creative. We get more reliable code than we could with jQuery-event-DOM-AJAX-eventlistener-spaghetti. Win. Win. Win. This is what libraries and frameworks should do for us, and React does it well.</p>\n<p>My experiments with React have been rewarding. I enjoy writing apps with React - it suits my way of subdividing problems into smaller modular pieces and recomposing them as a whole. The functional programming paradigm it encourages is well suited to what we do as web developers - and exposure to React and the thinking behind it has been educational and rewarding for most web developers I know. It can open opportunities.</p>\n<p>React is a success - in no place more than the contract developer job market. So much, that it threatens to overshadow other viable alternatives and skills for web developers. By becoming a <em>de facto</em> standard for interface development for the web, for <a href=\"https://facebook.github.io/react-native/\">mobile</a> and <a href=\"https://facebook.github.io/react-vr/\">VR</a>, I am sensing an assumption among managers and recruiters that JavaScript <em>is</em> React. We&#39;ve seen it happen in the past with jQuery - which was similarly enabling and educational for developers, but as a single dominant tool, was ultimately limiting. (See <a href=\"http://lea.verou.me/2015/04/jquery-considered-harmful/\">jQuery considered harmful | Lea Verou</a>). I recognise the pattern from the rise and fall of Flash and ActionScript - which at the time exposed computational capabilities to creative and artistic contibutors who were left high and dry with the emergence of mobile and no place to go. </p>\n<p>I&#39;ve been observing the React bandwagon for a while now with a view to jumping on. But utimately bandwagons are not my thing. Like the many libraries and frameworks before it, React is just one of the options out there. Right now <a href=\"https://vuejs.org/\">Vue.js</a> is a viable alternative, among the <a href=\"https://www.google.co.uk/search?q=react+alternatives\">many others blooming daily</a>, that solve similar problems. And still more will be created to solve the unique problems we have yet to encounter. Right now I&#39;m watching <a href=\"https://svelte.technology/\">Svelte • The magical disappearing UI framework</a>. </p>\n<p>A dominant paradigm, no matter how good it is, will not solve every problem. Sometimes the answer lies outside the popular patterns, framework or language everyone is using right now. Developers must learn to solve deeper problems and understand what lies beneath - and a job market that expects a narrow skill set will produce shallow developers. </p>\n<blockquote>\n<p>Single framework dominance is meta-level code smell</p>\n</blockquote>\n<p>Right now it&#39;s React. But utimately it&#39;s JavaScript and more ultimately it&#39;s all computational - and further even more ultimately -  it&#39;s about how people, machines and data interact. React can serve us well for the problems React is good at helping us solve.  But to rely completely on a single tool will limit possibilities to the capabilities of that tool, and train us into a particular way of thinking.  We will be out of capable skills when new problems present themselves.</p>\n<p>Learn React. Use React. React is good for right now. If you&#39;re a web developer you most likely need it right now. Many freelance contracts I see now currently require and assume knowledge of React.  I do think React is a genuine and worthy tool to know - but not to the exclusion of others.  </p>\n","url":"https://admataz.com/notes/react-everywhere","tags":["react","javascript","frameworks","libraries","paradigms"],"date_published":"2017-05-09T00:00:00.000Z","author":{"name":"Adam Davis"}}]}
